<template>
    <div id="ref">
        <h3>Как пользоваться приложением для управления отделом кадров</h3>
        <p class="info">В этой статье приведены полезные советы, которые помогут вам легко пользоваться приложением для управления отделом кадров.</p>
        <h4>Совет 1. Навигация</h4>
        <p class="info">Независимо от того, на какой странице приложения вы находитесь, вы можете попасть на любую страницу с помощью навигационной шапки, расположенной на самой верхней части экрана.</p>
        <img src="../assets/navbar.png" class="info" alt="navbar" width="900" height="30">
        <p class="info">Также, на домашней странице при нажатии на одну из таблиц, вы попадёте на на страницу с полной таблицей.</p>
        <img src="../assets/home_table.png" class="info" alt="home-table" width="900">
        <h4>Совет 2. Пользуйтесь поиском в таблице.</h4>
        <p class="info">Над каждой таблицей есть поиск по Ф.И.О., позволяющий вам быстро найти нужную запись.<br>
        После ввода, нажмите на соответствующую кнопку справа от поиска, либо нажмите на кнопку 'Enter' на вашей клавиатуре.</p>
        <p align="center"><img src="../assets/search.png" class="info" alt="home-table" width="500"></p>
        <h4>Совет 3. Добавление, изменение и удаление записей.</h4>
        <p class="info">Рядом с соответствующей таблицей расположены кнопки, позволяющие вам манипулировать данными в таблице. Если после нажатия на кнопку, изменений не произошло, то возможно, вы ввели несоответствующие данные в поле ввода.<br>Убедительная просьба не нажимать на все кнопки бездумно. Это может привести к поломке или засорением базу данных.
        </p>
    </div>
</template>

<script>
export default {
    name: 'Reference',
    data() {

    }
}
</script>

<style scoped>
    div#ref {
        margin: 0 150px;
        padding: 0 30px;
        border: 1px solid #BCBCBC;
        border-radius: 10px;
        margin-bottom: 10px;
    }

    p.info {
        font-size: large;
    }

    img.info {
        margin-bottom: 20px;
    }

    h3 {
        margin-top: 15px;
    }
</style>